app/views/posts/index.html.erb

SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = 8
---
<!-- <% if !params[:author].blank? %>
  <% @posts = Post.where(author: params[:author]) %>

SELECT "posts".* FROM "posts" WHERE (created_at <= '2018-11-01 00:00:00.000000')
---
  <%if params[:date] == "Today" %>
    <% @posts = Post.where("created_at >= ?", Time.zone.today.beginning_of_day) %>